from datetime import datetime
current_time = datetime.now().time()
choice = input("""Введите время в формате "hh:mm", 
либо нажмите "Enter" для использования текущего времени:\n""")

#check the entered parameters and select the option
if not choice:
    hours = current_time.hour
    minuts = current_time.minute
elif choice.replace(":","").isdigit() and int(choice[0:2]) < 24 and ":" in choice \
    and int(choice[3:5]) < 60 and len(choice) == 5:
    hours, minuts = map(int, choice.split(":"))
else:
    print("""Формат ввода времени не верен! (hh:mm)
    Использовано текущее время""")
    hours = current_time.hour
    minuts = current_time.minute

#output intermediate result
print(hours,":",minuts)

#create dictionaries
dict_hour = {1: "один час", 2: "два часа", 3: "три часа", 4: "четыре часа", 5: "пять часов",
            6: "шесть часов", 7: "семь часов", 8: "восемь часов", 9: "девять часов",
            10: "десять часов", 11: "одиннадцать часов", 12: "двенадцать часов",
            13: "один час", 14: "два часа", 15: "три часа", 16: "четыре часа", 17: "пять часов", 
            18: "шесть часов", 19: "семь часов", 20: "восемь часов", 21: "девять часов",
            22: "десять часов", 23: "одиннадцать часов", 24: "двенадцать часов"}
dict_hour_2 = {1: "второго", 2: "третьего", 3: "четвертого", 4: "пятого", 5: "шестого",
              6: "седьмого", 7: "восьмого", 8: "девятого", 9: "десятого", 10: "одиннадцатого",
              11: "двенадцатого", 12: "первого", 13: "второго", 14: "третьего", 15: "четвертого",
              16: "пятого", 17: "шестого", 18: "седьмого", 19: "восемого", 20: "девятого",
              21: "десятого", 22: "одиннадцатого", 23: "двенадцатого", 0: "первого"}
dict_hour_3 = {1: "час", 2: "два", 3: "три", 4: "четыре", 5: "пять", 6: "шесть",
               7: "семь", 8: "восемь", 9: "девять", 10: "десять", 11: "одиннадцать",
               12: "двенадцать", 13: "час", 14: "два", 15: "три", 16: "четыре", 17: "пять",
               18: "шесть", 19: "семь", 20: "восемь", 21: "девять", 22: "десять", 
               23: "одиннадцать", 24: "двенадцать"}
dict_minuts = {0: "ровно", 1: "одна минута", 2: "две минуты", 3: "три минуты", 4: "четыре минуты",
               5: "пять минут", 6: "шесть минут", 7: "семь минут", 8: "восемь минут",
               9: "девять минут", 10: "десять минут", 11: "одиннадцать минут",
               12: "двенадцать минут", 13: "тринадцать минут", 14: "четырнадцать минут",
               15: "пятнадцать минут", 16: "шестнадцать минут", 17: "семнадцать минут",
               18: "восемнадцать минут",19: "девятнадцать минут", 20: "двадцать", 30: "тридцать",
               40: "сорок", 50: "пятьдесят"}
dict_minuts_2 = {1: "одной минуты", 2: "двух минут", 3: "трех минут", 4: "четырех минут", 5: "пяти минут",
                 6: "шести минут", 7: "семи минут", 8: "восеми минут", 9: "девяти минут",
                 10: "десяти минут", 11: "одиннадцати минут", 12: "двенадцати минут",
                 13: "тринадцати минут", 14: "четырнадцати минут", 15: "пятнадцати минут"}
#variables for minutes
minuts_1 = minuts % 10
minuts_2 = minuts - minuts_1
if minuts in dict_minuts:
    y = dict_minuts.get(minuts)
else:
    y = dict_minuts.get(minuts_2) + " " + dict_minuts.get(minuts_1)
#use to dictionaries
if minuts == 0:
    print(dict_hour.get(hours), y)
elif minuts < 30 or minuts > 30 and minuts < 45:
    print(y, dict_hour_2.get(hours))
elif minuts == 30:
    print("половина", dict_hour_2.get(hours))
else:
    print("без", dict_minuts_2.get(60 - minuts), dict_hour_3.get(hours+1))