from datetime import datetime
button = int(input("Select mode: press 1 - to automatically display the current time; press 2 - enter the current time: "))
while button not in (1,2):
    button = int(input("oops, you pressed something wrong, try again: press 1 or 2 "))
if button == 1:
    now_time = datetime.today().strftime("%H:%M")
    hour = int(datetime.today().strftime("%H"))
    min = int(datetime.today().strftime("%M"))           
elif button == 2:
      while True:
        users_time = input("Enter current time in hh:mm format:") 
        if users_time.split(':')[0].isdigit():
            if users_time.split(':')[1].isdigit():
                if -1 < int(users_time.split(':')[0]) < 24:
                    if -1 < int(users_time.split(':')[1]) < 60:
                        break    
      time = users_time.split(':')
      hour = int(time[0])
      min = int(time[1])
      now_time = users_time
hours_dict = {1:("час", "первого"), 2:("два", "второго"), 3:("три", "третьего"), 4:("четыре", "четвертого"),
5:("пять", "пятого"), 6:("шесть", "шестого"), 7:("семь", "седьмого"), 8:("восемь", "восьмого"),
9:("девять", "девятого"), 10:("десять", "десятого"), 11:("одиннадцать", "одиннадцатого"), 12:("двенадцать", "двенадцатого"),0:("ноль","")}
minutes_dict = {1:("одна минута", "одной минуты"), 2:("две минуты", "двух минут"), 3:("три минуты", "трех минут"), 4:("четыре минуты", "четырёх минут"),
5:("пять минут", "пяти минут"), 6:("шесть минут", "шести минут"), 7:("семь минут", "семи минут"), 8:("восемь минут", "восьми минут"),
9:("девять минут", "девяти минут"), 10:("десять минут", "десяти минут"), 11:("одиннадцать минут", "одиннадцати минут"), 12:("двенадцать минут", "двенадцати минут"), 
13:("тринадцать минут", "тринадцати минут"), 14:("четырнадцать минут", "четырнадацати минут"), 15:("пятнадцать минут", "пятнадцати минут"),
16:("шестнадцать минут"), 17:("семнадцать минут"), 18:("восемнадцать минут"), 19:("девятнадцать минут"), 20:("двадцать минут"), 21:("двадцать одна минута"),
22:("двадцать две минуты"), 23:("двадцать три минуты"), 24:("двадцать четыре минуты"), 25:("двадцать пять минут"), 26:("двадцать шесть минут"), 27:("двадцать семь минут"),
28:("двадцать восемь минут"), 29:("двадцать девять минут"), 30:("половина"), 31:("тридцать одна минута"), 32:("тридцать две минуты"), 33:("тридцать три минуты"),
34:("тридцать четыре минуты"), 35:("тридцать пять минут"), 36:("тридцать шесть минут"), 37:("тридцать семь минут"), 38:("тридцать восемь минут"), 39:("тридцать девять минут"),
40:("сорок минут"), 41:("сорок одна минута"), 42:("сорок две минуты"), 43:("сорок три минуты"), 44:("сорок четыре минуты"), 0:("ровно")}
hour=hour-12 if hour>=12 else hour
if min==0:
    if hour==1:
        print(now_time,": " f'{hours_dict[hour][0]} {minutes_dict[0]}')
    elif 1<hour<5:
        print(now_time,": " f'{hours_dict[hour][0]} часа {minutes_dict[0]}')
    else:
        print(now_time,": " f'{hours_dict[hour][0]} часов {minutes_dict[0]}') 
elif 0<min<16:
    print(now_time,"-" f'{minutes_dict[min][0]} {hours_dict[hour+1][1]}')
elif min<45:
     print(now_time,"- " f'{minutes_dict[min]} {hours_dict[hour+1][1]}')
elif min>=45:
     min=60-min
     print(now_time,"- " f'без {minutes_dict[min][1]} {hours_dict[hour+1][0]}') 


 

