import time
current_time = time.localtime()

UserInput = int(input('Нажмите 1, чтобы узнать текущее время.\n Нажмите 2, чтобы ввести любое время:\n'))
if UserInput == 1:
    h = int(time.strftime("%H", current_time))
    m = int(time.strftime("%M", current_time))
elif UserInput == 2:
     h, m = input("Введите любое время в формате 00 00 (через пробел!):\n").split()
     h = int(h)
     m = int(m)

dic_h = {1:[('один'), ('первого')], 2:[('два'), ('второго')], 3:[('три'), ('третьего')], 4:[('четыре'), ('четвертого')], 5:[('пять'), ('пятого')],
6:['шесть', ('шестого')], 7: [('семь '), ('седьмого')], 8:[('восемь'), ('восьмого')], 9:['девять', ('девятого')], 10:['десять', ('десятого')], 
11:[('одиннадцать'), ('одиннадцатого')], 12:[('двенадцать'), ('двенадцатого')],  13:[('час'), ('первого')], 14:[('два'), ('второго')], 
15:[('три'), ('третьего')], 16:[('четыре '), ('четвертого')], 17:[('пять'), ('пятого')], 18:[('шесть'), ('шестого')], 19:[('семь'), ('седьмого')],
20:[('восемь'), ('восьмого')],  21:[('девять'), ('девятого')], 22:[('десять'), ('десятого')], 23:[('одиннадцать'), ('одиннадцатого')], 24: [('двенадцать'), ('двенадцатого')], 00:'полночь', }

dic_m = {0:'ровно', 00:'ровно', 1:'одна', 2:'две', 3:'три', 4:'четыре', 5:'пять', 6:'шесть', 7:'семь ', 8:'восемь', 9:'девять', 10:'десять', 
11:'одиннадцать', 12:'двенадцать', 13:'тринадцать', 14:'четырнадцать', 15:'пятнадцать', 16:'шестнадцать', 17:'семнадцать', 18:'восемьнадцать',
19:'девятнадцать', 20:'двадцать', 21:'двадцать одна', 22:'двадцать две', 23:'двадцать три', 24:'двадцать четыре', 25:'двадцать пять',
26:'двадцать шесть', 27:'двадцать семь', 28:'двадцать восемь', 29:'двадцать девять', 30:'половина', 31:'тридцать одна', 32:'тридцать две',
33:'тридцать три', 34:'тридцать четыре', 35:'тридцать пять', 36:'тридцать шесть', 37:'тридцать семь', 38:'тридцать восемь', 39:'тридцать девять', 
40:'сорок', 41:'сорок одна', 42:'сорок  две', 43:'сорок три', 44:'сорок четыре', 45:'без пятнадцати', 46:'без четырнадцати', 47:'без тринадцати',
48:'без двенадцати', 49:'без одинадцати', 50:'без десяти', 51:'без девяти', 52:'без восьми', 53:'без семи', 54:'без шести', 55:'без пяти',56:'без четырех', 57:'без трех', 58:'без двух', 59:'без одной',}

dic_hm = {'hour': [('час'), ('часа'), ('часов')], 'minute': [('минут'), ('минута'), ('минуты')], }

if m == 0 and h == 1:
   print(h, ':', m, '-', f'{dic_h.get(h)[0]}', ' ', dic_hm["hour"][0], ' ', f'{dic_m[m]}', sep='')

elif m == 0 and h == 13:
       print(h, ':', m, '-', f'{dic_h.get(h)[0]}', ' ', f'{dic_m[m]}', sep='')

elif m == 0 and (5 > h > 1 or 17 > h > 13):
    print(h, ':', m, '-', f'{dic_h.get(h)[0]}', ' ', dic_hm["hour"][1], ' ', f'{dic_m[m]}', sep='')
    
elif m == 0 and  (13 > h > 4  or  24 > h > 16):
    print(h, ':', m, '-', f'{dic_h.get(h)[0]}', ' ', dic_hm["hour"][2], ' ', f'{dic_m[m]}', sep='')

elif m == 30:
     h_1 = h + 1
     print(h, ':', m, '-', f'{dic_m[m]}', ' ', f'{dic_h.get(h_1)[1]}', sep='')

elif 21 > int(m) > 4 or  41 > int(m) > 34 or 30 > int(m) > 24:
     h_1 = h + 1
     print(h, ':', m, '-', f'{dic_m[m]}', ' ', dic_hm["minute"][0], ' ', f'{dic_h.get(h_1)[1]}', sep='')

elif m == 1 or m == 31 or m == 21 or m == 41:
     h_1 = h + 1
     print(h, ':', m, '-', f'{dic_m[m]}', ' ', dic_hm["minute"][1], ' ', f'{dic_h.get(h_1)[1]}', sep='')

elif 5 > int(m) > 1 or  25 >int(m) > 21 or 35 > int(m) > 31 or 45 >int(m) > 41:
     h_1 = h + 1
     print(h, ':', m, '-', f'{dic_m[m]}', ' ',  dic_hm["minute"][2], ' ', f'{dic_h.get(h_1)[1]}', sep='')

elif m == 45 or 59 > int(m) > 44:
     h_1 = h + 1
     print(h, ':', m, '-', f'{dic_m[m]}', ' ',  dic_hm["minute"][0], ' ', f'{dic_h.get(h_1)[0]}', sep='')

elif m == 59:
     h_1 = h + 1
     print(h, ':', m, '-', f'{dic_m[m]}', ' ', dic_hm["minute"][2], ' ', f'{dic_h.get(h_1)[0]}', sep='')
else: 
     print ("Неверный формат ввода, запустите программу заново")

